Revit 2024 API
BuiltInFailures.FamilyFailures.NotFamilyFile Property
 The selected file is not a Family File.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotFamilyFile { get; }
Visual Basic
Public Shared ReadOnly Property NotFamilyFile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotFamilyFile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace